#include <iostream>
#include <clocale>
#include <cmath>


using namespace std;


int main()
{
	setlocale(LC_ALL, "Russian");


	float a, b;
	cout << "Введите стороны прямоугальника: ";
	cin >> a >> b;
	cout << "Площадь прямугольника со сторонами " << a << " и " << b << " = " << a * b << endl;
	cout << "Периметр прямугольника со сторонами " << a << " и " << b << " = " << 2*(a + b) << endl;


	float d;
	cout << "Введите диаметр окружности: ";
	cin >> d;
	cout << "Длинна окружности с диаметром " << d << " = " << d * 3.14 << endl;


	// не создаю новые переменные, а перезаписываю старые
	cout << "Введите два числа: ";
	cin >> a >> b;
	cout << "Среднее арифметическое " << a << " и " << b << " = " << (a + b)/2 << endl;


	// тут тоже перезаписываю старые
	cout << "Введите два числа( кроме 0 ): ";
	cin >> a >> b;
	cout << "Сумма квадратов " << a << " и " << b << " = " << a * a + b * b << endl;
	cout << "Разность квадратов " << a << " и " << b << " = " << a * a - b * b << endl;
	cout << "Произведение квадратов " << a << " и " << b << " = " << (a * a) * (b * b) << endl;
	cout << "Частное квадратов " << a << " и " << b << " = " << (a * a) / (b * b) << endl;


	// снова перезаписываю старые переменные
	cout << "Введите два числа( кроме 0 ): ";
	cin >> a >> b;
	cout << "Сумма модулей " << a << " и " << b << " = " << abs(a) + abs(b) << endl;
	cout << "Разность модулей " << a << " и " << b << " = " << abs(a) - abs(b) << endl;
	cout << "Произведение модулей " << a << " и " << b << " = " << abs(a) * abs(b) << endl;
	cout << "Частное модулей " << a << " и " << b << " = " << abs(a) / abs(b) << endl;


	return 0;
}
